import aboutImage from '@public/images/about-us/1.png';
import Image from 'next/image';
import PageTitle from '../../atoms/PageTitle/PageTitle';

const AboutUsDescriptionTemplate = () => {
    return (
        <section className='relative mt-4 lg:mt-[22px]'>
            <Image
                src={aboutImage}
                alt='steve'
                width={1644}
                height={492}
                className='aspect-[1.5] w-full rounded-lg object-cover md:aspect-[1644/492]'
            />

            <PageTitle title='درباره ما' />

            <div className='text-md mt-[25px] leading-[50px] font-light lg:text-xl'>
                استیو با یک هدف ساده اما بزرگ متولد شد: ایجاد تجربه‌ای شفاف، راحت و مطمئن در خرید، فروش و تعمیر گوشی‌های
                هوشمند. در دنیایی که تکنولوژی با سرعت بالا تغییر می‌کند، ما در استیو تلاش می‌کنیم تا دسترسی به گوشی‌های
                باکیفیت و خدمات فنی تخصصی را برای همه آسان‌تر کنیم — بدون پیچیدگی، بدون ابهام و بدون دردسر. خرید و فروش
                گوشی دست دوم، با خیال راحت بازار گوشی‌های دست دوم همیشه پر از چالش بوده: قیمت‌های غیرواقعی، دستگاه‌های
                مشکل‌دار، معامله‌های پرریسک. ما در استیو این روند را کاملاً تغییر داده‌ایم. در استیو، همه گوشی‌های دست
                دوم قبل از فروش، توسط تیم متخصص ما به‌صورت کامل و دقیق تست می‌شوند. باتری، نمایشگر، دوربین، بدنه و سایر
                اجزای اصلی بررسی می‌شوند تا هیچ نکته‌ای از چشم پنهان نماند. گوشی‌ها بر اساس وضعیت ظاهری و فنی دسته‌بندی
                می‌شوند، قیمت‌گذاری منصفانه دارند و همراه با گزارش کارشناسی و ضمانت سلامت به مشتری تحویل داده می‌شوند.
                اگر قصد فروش گوشی دارید، ما با قیمت‌گذاری شفاف و لحظه‌ای، پرداخت سریع، و جمع‌آوری رایگان از محل، فرآیند
                فروش را برای شما ساده و بدون دردسر می‌کنیم. تعمیرات تخصصی، با قطعات اصل و ضمانت گوشی‌تان خراب شده؟ نگران
                نباشید. بخش تعمیرات استیو با تکیه بر تکنسین‌های حرفه‌ای و استفاده از قطعات اصل، خدماتی سریع، دقیق و قابل
                اعتماد ارائه می‌دهد.  ما هر تعمیر را با بالاترین استانداردهای فنی انجام می‌دهیم، و روی بیشتر خدمات،
                گارانتی معتبر ارائه می‌کنیم. از تعویض باتری و نمایشگر گرفته تا تعمیرات تخصصی برد، می‌توانید به استیو
                اعتماد کنید. چرا استیو؟ قیمت‌گذاری شفاف و منصفانه بررسی کارشناسی دقیق همه گوشی‌ها خدمات پس از فروش و
                پشتیبانی حرفه‌ای پرداخت سریع و جمع‌آوری رایگان برای فروشندگان استفاده از قطعات اصل در تعمیرات ضمانت
                کیفیت در خرید و تعمیر ما به چه چیزهایی باور داریم؟ ما در استیو به شفافیت، صداقت و رضایت مشتری باور
                داریم. معتقدیم که اعتماد، پایه‌ی اصلی هر معامله موفق است، و به همین دلیل تلاش می‌کنیم تا در هر مرحله از
                ارتباط با شما، تجربه‌ای حرفه‌ای، محترمانه و بی‌نقص رقم بزنیم.
            </div>
        </section>
    );
};

export default AboutUsDescriptionTemplate;
